docs/posts/2015-01-13-new-friends.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 24, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>New Friends</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">New Friends</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
We met some very interesting people during our stay at the <a href="http://www.ullikana.com">Ullikana Inn</a> in Bar Harbor, Maine. There were two couples there that, generally with some other couples, return every year. Before dinner, everyone met for some refreshments, during which they told about their usual evening activity at the inn. Evidently, the first time that the couples had been at the inn together, they found themselves in that room making the sort of small talk that people do when they don&rsquo;t really know each other. Then, one asked, &ldquo;What should we talk about?&rdquo; Another answered, &ldquo;How about what happens to you when you die.&rdquo;
</p>

<p>
After telling us this, one turned to me and said, &ldquo;You bring the topic this evening. The only rule is that it has to be controversial.&rdquo; Given that the Slender Man violence had been in the news, I asked if artists and writers had moral obligations that should govern how and what kinds of art are made available to the public. It was a very lively conversation that lasted more than two hours. Friends from different backgrounds, all discussing a controversial topic, with no one taking offense&#x2014;it was a wonderful time.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 24, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
